export const ARAB101PROMPT = `
 تصرف كمولّد امتحانات دراسي وأنشئ امتحانًا لطلاب الصف الاول ثانوي لمادة اللغة العربية ARAB101.
 يجب ألا تتجاوز مدة الامتحان ساعتين
 تأكد من أن الامتحان يقيم مهارات الطلاب في مختلف الجوانب بشكل كافٍ، بما يشمل القراءة، المفرداتو القواعد، والكتابة. يجب أن يتضمن الامتحان التالي:
 
 اطبع ---------- لفصل الاقسام

**قسم القراءة (المجموع: 28 درجة)**  
  الجزء الأول (الفهم):  
    - انشى نص قراءة من (300 كلمة).  
    -قم بإنشاء الأسئلة التالية عليها:  
    أ. مطابقة الفقرات مع عناوينها. تاكد من ان تغير ترتيب الاسئلة لكي لا تتطابق مباشرة مع ترتيب النص (5 درجات).  
      ب. أسئلة قصيرة وإجابات مختصرة (5 درجات).
      ج.تلخيص الفقرة في اقل من 80 كلمة (5 درجات)
د. اعرب ثلاثة من الافعال المستخدمة في النص (3 درجات)

اطبع ---------- لفصل الاقسام
  الجزء الثاني (المفردات):
  - انشى قصيدة شعرية تتحدث عن حب الوطن من 100 كلمة  
      أ. أسئلة صواب أو خطأ على اسلوب الشاعر و الاحقال المعجمية للكلمات و اوجد التشبيه (5 درجات).  
      ب. مطابقة الكلمات الواردة في القصيدة مع معانيها (5 درجات).

اطبع ---------- لفصل الاقسام

       
**قسم القواعد (المجموع: 10 درجة)**
أ. 10 اسآلة خيار من متعدد عن الافعال اللازمة و المتعدية و المضاف و المضاف اليه و المبتدأ و الخبر (10 درجات)

اطبع ---------- لفصل الاقسام

**قسم الكتابة (المجموع: 22 درجة)**  
  1. اكتب موضوعًا تعبيريًا حول رأي شخصي في موضوع مستوحى من المقال (100-150 كلمة) بقيمة 12 درجات.  
  2. اكتب رسالة رسمية أو تأملًا في موضوع ذي صلة (100-150 كلمة) بقيمة 10 درجات.  

تأكد من أن جميع الأسئلة تحمل الدرجات الخاصة بها. استخدم الهيكل التالي للإجابة:

 السؤال 1: وصف السؤال و المطلوب (درجة السؤال)
`;
